tests/resources/GenerateRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
    <SOAP-ENV:Body>
        <ns1:Genera>
            <ns1:usuario>test</ns1:usuario>
            <ns1:password>test</ns1:password>
            <ns1:hash>zDaCU4rWcC5OllZleSjmeKV3YcbfknlZfb7PPEVpeXo=</ns1:hash>
            <ns1:identificador>1234</ns1:identificador>
        </ns1:Genera>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>